[
  {
    "id": "World Atlas",
    "name": "World Atlas",
    "description": "An interactive map showcasing various places around the world.",
    "link": "https://myworldatlass.netlify.app/",
    "title": "World Atlas",
    "image": "/images/world_SS.png",
    "qr": "/images/world_qr.png",
    "Technologies": [
      "React",
      "Tailwind CSS",
      "Framer Motion",
      "REST Countries API",
      "Netlify"
    ],
    "Full_description": [
    "Built a fully responsive React app using modular, reusable components and Tailwind CSS for a dynamic, mobile-first UI.",
    "Displayed comprehensive country data (flags, capitals, currencies, regions) with real-time search and dynamic filters.",
    "Integrated Wikipedia links and a secondary API to provide historical and factual insights.",
    "Enhanced user experience with light/dark theme toggle, animated transitions via Framer Motion, and loading skeletons.",
    "Optimized performance, ensured cross-browser compatibility, deployed via Netlify, and managed code with Git/GitHub."
  ]
  },
  {
    "id": "EverSafe Insurance",
    "name": "EverSafe Insurance",
    "description": "A mock insurance website providing various insurance services.",
    "link": "https://eversafeinsurance.netlify.app/",
    "title": "EverSafe Insurance",
    "image": "/images/eversafe_SS.png",
    "qr": "/images/ever_qr.png",
    "Technologies": [
      "React",
      "Tailwind",
      "HTML",
      "CSS",
      "API",
      "Netlify",
      "Framer-Motion"
    ],
    "Full_description": [
    "Built a responsive insurance website using React.js and Bootstrap 5 with modular components for easy maintenance.",
    "Designed service pages covering various insurance types, including health, auto, life, travel, and business.",
    "Integrated animations with Framer Motion and used Swiper/Bootstrap sliders for showcasing featured policies.",
    "Ensured accessibility and usability through form validation, semantic HTML5, ARIA tags, and React Router for navigation.",
    "Optimized performance with lazy loading, structured JSON data, SEO controls, and deployed via Netlify with Git/GitHub."
  ]
  },
  {
    "id": "Live Weather Website",
    "name": "Live Weather Website",
    "description": "A weather forecasting website using real-time APIs.",
    "link": "https://liveweatherwebsite.netlify.app/",
    "title": "Live Weather Website",
    "image": "/images/weather_SS.png",
    "qr": "/images/weath_qr.png",
    "Technologies": [
      "JavaScript",
      "HTML",
      "CSS",
      "OpenWeather API",
      "Netlify"
    ],
    "Full_description": [
    "Developed a responsive weather with 5-Days forecast website using core JavaScript, HTML5, and CSS3 with a mobile-friendly layout.",
    "Integrated OpenWeatherMap API to fetch and display real-time weather data by city name.",
    "Used DOM manipulation for dynamic updates of temperature, humidity, wind speed, and conditions.",
    "Enhanced UX with search input, loading indicators, animated cards, and current date/time functionality.",
    "Ensured cross-browser compatibility, optimized performance, and deployed via Netlify with Git/GitHub."
  ]
  },
  {
    "id": "BMI Calc with Hight Converter ",
    "name": "BMI Calc with Hight Converter ",
    "description": "calculate Body Mass Index (BMI) based on user input.",
    "link": "https://bmicalcindex.netlify.app/",
    "title": "BMI Calculator",
    "image": "/images/bmi_SS.png",
    "qr": "/images/bmi_qr.png",
    "Technologies": [
      "JavaScript",
      "HTML",
      "CSS",
      "Netlify"
    ],
    "Full_description": [
    "Created a responsive BMI Calculator using HTML, CSS, and JavaScript with real-time input handling and validation.",
    "Included interactive height conversion between feet/inches and centimeters, supporting both metric and imperial units.",
    "Calculated BMI and categorized results into standard health classifications with color-coded visual feedback.",
    "Modularized JavaScript for clean calculation, conversion, and UI rendering, enhanced with transitions and tooltips.",
    "Deployed on Netlify, maintained with Git/GitHub, and designed a user-friendly interface using Flexbox and hover effects."
  ]
  }
]